Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateSlantedWallWithSingularLayersError Property
 Cannot create wall - its layers would degenerate or. Reduce the wall's height or slant.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateSlantedWallWithSingularLayersError { get; }
Public Shared ReadOnly Property CannotCreateSlantedWallWithSingularLayersError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateSlantedWallWithSingularLayersError {
	FailureDefinitionId^ get ();
}
static member CannotCreateSlantedWallWithSingularLayersError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace